test/benchmark/results.txt
Testing /campaigns?all
Running 30s test @ http://localhost:3014/campaigns?all
  1 threads and 100 connections
  Thread calibration: mean lat.: 5383.545ms, rate sampling interval: 18219ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    19.76s     5.53s   29.47s    57.99%
    Req/Sec    29.00      0.00    29.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   19.76s
 75.000%   24.56s
 90.000%   27.44s
 99.000%   29.18s
 99.900%   29.44s
 99.990%   29.49s
 99.999%   29.49s
100.000%   29.49s

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9969.663     0.000000            1         1.00
   12083.199     0.100000           58         1.11
   14024.703     0.200000          116         1.25
   15990.783     0.300000          173         1.43
   17858.559     0.400000          231         1.67
   19759.103     0.500000          288         2.00
   20725.759     0.550000          319         2.22
   21643.263     0.600000          346         2.50
   22659.071     0.650000          375         2.86
   23674.879     0.700000          405         3.33
   24559.615     0.750000          433         4.00
   25165.823     0.775000          449         4.44
   25542.655     0.800000          461         5.00
   25985.023     0.825000          476         5.71
   26411.007     0.850000          490         6.67
   26935.295     0.875000          504         8.00
   27328.511     0.887500          513         8.89
   27443.199     0.900000          519        10.00
   27754.495     0.912500          528        11.43
   27901.951     0.925000          533        13.33
   28098.559     0.937500          540        16.00
   28262.399     0.943750          545        17.78
   28491.775     0.950000          549        20.00
   28540.927     0.956250          551        22.86
   28639.231     0.962500          557        26.67
   28688.383     0.968750          559        32.00
   28753.919     0.971875          560        35.56
   28786.687     0.975000          562        40.00
   28868.607     0.978125          564        45.71
   28983.295     0.981250          566        53.33
   28999.679     0.984375          567        64.00
   29016.063     0.985938          568        71.11
   29065.215     0.987500          569        80.00
   29179.903     0.989062          570        91.43
   29196.287     0.990625          571       106.67
   29212.671     0.992188          572       128.00
   29212.671     0.992969          572       142.22
   29278.207     0.993750          573       160.00
   29278.207     0.994531          573       182.86
   29409.279     0.995313          574       213.33
   29409.279     0.996094          574       256.00
   29409.279     0.996484          574       284.44
   29442.047     0.996875          575       320.00
   29442.047     0.997266          575       365.71
   29442.047     0.997656          575       426.67
   29442.047     0.998047          575       512.00
   29442.047     0.998242          575       568.89
   29491.199     0.998437          576       640.00
   29491.199     1.000000          576          inf
#[Mean    =    19762.524, StdDeviation   =     5533.922]
#[Max     =    29474.816, Total count    =          576]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  871 requests in 30.01s, 1.11GB read
  Socket errors: connect 0, read 0, write 0, timeout 612
Requests/sec:     29.02
Transfer/sec:     37.79MB
Testing /campaigns  (will get only Active/~Ready)
Running 30s test @ http://localhost:3014/campaigns
  1 threads and 100 connections
  Thread calibration: mean lat.: 6283.570ms, rate sampling interval: 18350ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    19.03s     5.30s   28.48s    57.69%
    Req/Sec   122.00      0.00   122.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   19.10s
 75.000%   23.66s
 90.000%   26.35s
 99.000%   27.98s
 99.900%   28.31s
 99.990%   28.49s
 99.999%   28.49s
100.000%   28.49s

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9682.943     0.000000            1         1.00
   11673.599     0.100000          240         1.11
   13533.183     0.200000          479         1.25
   15335.423     0.300000          719         1.43
   17186.815     0.400000          959         1.67
   19103.743     0.500000         1201         2.00
   19972.095     0.550000         1318         2.22
   20856.831     0.600000         1437         2.50
   21823.487     0.650000         1557         2.86
   22740.991     0.700000         1677         3.33
   23658.495     0.750000         1797         4.00
   24100.863     0.775000         1861         4.44
   24543.231     0.800000         1917         5.00
   24985.599     0.825000         1976         5.71
   25477.119     0.850000         2037         6.67
   25903.103     0.875000         2095         8.00
   26099.711     0.887500         2126         8.89
   26345.471     0.900000         2156        10.00
   26558.463     0.912500         2185        11.43
   26820.607     0.925000         2217        13.33
   27049.983     0.937500         2247        16.00
   27148.287     0.943750         2262        17.78
   27230.207     0.950000         2276        20.00
   27361.279     0.956250         2291        22.86
   27492.351     0.962500         2307        26.67
   27574.271     0.968750         2321        32.00
   27639.807     0.971875         2328        35.56
   27688.959     0.975000         2335        40.00
   27721.727     0.978125         2343        45.71
   27803.647     0.981250         2350        53.33
   27836.415     0.984375         2357        64.00
   27918.335     0.985938         2364        71.11
   27934.719     0.987500         2365        80.00
   27967.487     0.989062         2368        91.43
   28000.255     0.990625         2373       106.67
   28033.023     0.992188         2377       128.00
   28049.407     0.992969         2378       142.22
   28082.175     0.993750         2380       160.00
   28098.559     0.994531         2383       182.86
   28098.559     0.995313         2383       213.33
   28131.327     0.996094         2386       256.00
   28131.327     0.996484         2386       284.44
   28180.479     0.996875         2388       320.00
   28180.479     0.997266         2388       365.71
   28196.863     0.997656         2389       426.67
   28246.015     0.998047         2390       512.00
   28246.015     0.998242         2390       568.89
   28311.551     0.998437         2392       640.00
   28311.551     0.998633         2392       731.43
   28311.551     0.998828         2392       853.33
   28311.551     0.999023         2392      1024.00
   28311.551     0.999121         2392      1137.78
   28360.703     0.999219         2393      1280.00
   28360.703     0.999316         2393      1462.86
   28360.703     0.999414         2393      1706.67
   28360.703     0.999512         2393      2048.00
   28360.703     0.999561         2393      2275.56
   28491.775     0.999609         2394      2560.00
   28491.775     1.000000         2394          inf
#[Mean    =    19030.447, StdDeviation   =     5295.226]
#[Max     =    28475.392, Total count    =         2394]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3290 requests in 30.00s, 0.92GB read
  Socket errors: connect 0, read 0, write 0, timeout 80
Requests/sec:    109.65
Transfer/sec:     31.26MB
Testing getting a specific campaign
Running 30s test @ http://localhost:3014/campaigns/0x0452e6409dfe99f14ced8b28faf12fca73e8b2c0b019d12601ed814f600ce60d
  1 threads and 100 connections
  Thread calibration: mean lat.: 53.910ms, rate sampling interval: 439ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.96ms    2.38ms  35.46ms   88.00%
    Req/Sec     2.00k    26.99     2.12k    95.45%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.55ms
 75.000%    4.49ms
 90.000%    5.69ms
 99.000%   13.45ms
 99.900%   25.31ms
 99.990%   32.77ms
 99.999%   35.49ms
100.000%   35.49ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.484     0.000000            1         1.00
       2.007     0.100000         3902         1.11
       2.481     0.200000         7801         1.25
       2.859     0.300000        11709         1.43
       3.213     0.400000        15622         1.67
       3.551     0.500000        19506         2.00
       3.715     0.550000        21454         2.22
       3.895     0.600000        23420         2.50
       4.085     0.650000        25370         2.86
       4.279     0.700000        27347         3.33
       4.495     0.750000        29270         4.00
       4.615     0.775000        30236         4.44
       4.755     0.800000        31223         5.00
       4.915     0.825000        32201         5.71
       5.103     0.850000        33160         6.67
       5.339     0.875000        34129         8.00
       5.495     0.887500        34623         8.89
       5.691     0.900000        35115        10.00
       6.003     0.912500        35592        11.43
       6.491     0.925000        36080        13.33
       7.227     0.937500        36568        16.00
       7.695     0.943750        36812        17.78
       8.139     0.950000        37054        20.00
       8.575     0.956250        37298        22.86
       9.039     0.962500        37545        26.67
       9.519     0.968750        37788        32.00
       9.831     0.971875        37909        35.56
      10.151     0.975000        38029        40.00
      10.511     0.978125        38152        45.71
      10.903     0.981250        38273        53.33
      11.471     0.984375        38397        64.00
      11.831     0.985938        38457        71.11
      12.343     0.987500        38517        80.00
      13.047     0.989062        38578        91.43
      13.647     0.990625        38639       106.67
      14.687     0.992188        38700       128.00
      15.183     0.992969        38730       142.22
      16.087     0.993750        38762       160.00
      16.607     0.994531        38791       182.86
      17.951     0.995313        38822       213.33
      19.039     0.996094        38853       256.00
      19.487     0.996484        38867       284.44
      20.351     0.996875        38883       320.00
      21.103     0.997266        38898       365.71
      22.095     0.997656        38913       426.67
      23.071     0.998047        38928       512.00
      23.519     0.998242        38936       568.89
      24.063     0.998437        38944       640.00
      24.447     0.998633        38951       731.43
      25.103     0.998828        38960       853.33
      25.375     0.999023        38966      1024.00
      25.839     0.999121        38970      1137.78
      26.239     0.999219        38974      1280.00
      27.439     0.999316        38978      1462.86
      27.679     0.999414        38982      1706.67
      29.055     0.999512        38985      2048.00
      29.215     0.999561        38987      2275.56
      29.919     0.999609        38989      2560.00
      30.159     0.999658        38991      2925.71
      30.383     0.999707        38993      3413.33
      30.511     0.999756        38995      4096.00
      30.687     0.999780        38996      4551.11
      30.735     0.999805        38997      5120.00
      31.631     0.999829        38998      5851.43
      32.463     0.999854        38999      6826.67
      32.767     0.999878        39000      8192.00
      32.767     0.999890        39000      9102.22
      33.535     0.999902        39001     10240.00
      33.535     0.999915        39001     11702.86
      33.663     0.999927        39002     13653.33
      33.663     0.999939        39002     16384.00
      33.663     0.999945        39002     18204.44
      34.303     0.999951        39003     20480.00
      34.303     0.999957        39003     23405.71
      34.303     0.999963        39003     27306.67
      34.303     0.999969        39003     32768.00
      34.303     0.999973        39003     36408.89
      35.487     0.999976        39004     40960.00
      35.487     1.000000        39004          inf
#[Mean    =        3.956, StdDeviation   =        2.375]
#[Max     =       35.456, Total count    =        39004]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  59550 requests in 30.00s, 31.18MB read
Requests/sec:   1985.00
Transfer/sec:      1.04MB
Testing /campaigns?limitForPublisher reached limit
Running 30s test @ http://localhost:3014/campaigns?all&limitForPublisher=0xB7d3F81E857692d13e9D63b232A90F4A1793189E
  1 threads and 100 connections
  Thread calibration: mean lat.: 5300.871ms, rate sampling interval: 18071ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    19.63s     5.51s   29.18s    57.56%
    Req/Sec    48.00      0.00    48.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   19.58s
 75.000%   24.46s
 90.000%   27.21s
 99.000%   28.87s
 99.900%   29.20s
 99.990%   29.20s
 99.999%   29.20s
100.000%   29.20s

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9920.511     0.000000            1         1.00
   11993.087     0.100000           96         1.11
   13959.167     0.200000          191         1.25
   15818.751     0.300000          286         1.43
   17727.487     0.400000          381         1.67
   19578.879     0.500000          477         2.00
   20496.383     0.550000          525         2.22
   21577.727     0.600000          574         2.50
   22609.919     0.650000          621         2.86
   23429.119     0.700000          667         3.33
   24461.311     0.750000          714         4.00
   24821.759     0.775000          738         4.44
   25411.583     0.800000          765         5.00
   25788.415     0.825000          786         5.71
   26329.087     0.850000          810         6.67
   26755.071     0.875000          834         8.00
   27017.215     0.887500          846         8.89
   27213.823     0.900000          857        10.00
   27590.655     0.912500          869        11.43
   27787.263     0.925000          881        13.33
   28033.023     0.937500          893        16.00
   28131.327     0.943750          900        17.78
   28213.247     0.950000          905        20.00
   28327.935     0.956250          911        22.86
   28491.775     0.962500          918        26.67
   28573.695     0.968750          923        32.00
   28655.615     0.971875          926        35.56
   28721.151     0.975000          930        40.00
   28753.919     0.978125          932        45.71
   28770.303     0.981250          936        53.33
   28835.839     0.984375          938        64.00
   28852.223     0.985938          941        71.11
   28852.223     0.987500          941        80.00
   28868.607     0.989062          942        91.43
   28917.759     0.990625          944       106.67
   28950.527     0.992188          945       128.00
   28999.679     0.992969          946       142.22
   29016.063     0.993750          947       160.00
   29016.063     0.994531          947       182.86
   29048.831     0.995313          948       213.33
   29081.599     0.996094          950       256.00
   29081.599     0.996484          950       284.44
   29081.599     0.996875          950       320.00
   29081.599     0.997266          950       365.71
   29081.599     0.997656          950       426.67
   29196.287     0.998047          952       512.00
   29196.287     1.000000          952          inf
#[Mean    =    19630.885, StdDeviation   =     5507.007]
#[Max     =    29179.904, Total count    =          952]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1421 requests in 30.03s, 80.41MB read
  Socket errors: connect 0, read 0, write 0, timeout 210
Requests/sec:     47.31
Transfer/sec:      2.68MB
Testing /campaigns?limitForPublisher unreached limit
Running 30s test @ http://localhost:3014/campaigns?all&limitForPublisher=0x65B74360431964f587bDcc5fE18C187DC37De286
  1 threads and 100 connections
  Thread calibration: mean lat.: 6747.085ms, rate sampling interval: 19202ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    19.79s     5.49s   29.39s    58.23%
    Req/Sec    28.00      0.00    28.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   19.74s
 75.000%   24.58s
 90.000%   27.41s
 99.000%   29.18s
 99.900%   29.29s
 99.990%   29.41s
 99.999%   29.41s
100.000%   29.41s

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10117.119     0.000000            1         1.00
   12255.231     0.100000           56         1.11
   14131.199     0.200000          113         1.25
   15843.327     0.300000          166         1.43
   17809.407     0.400000          223         1.67
   19742.719     0.500000          277         2.00
   20922.367     0.550000          305         2.22
   21643.263     0.600000          333         2.50
   22527.999     0.650000          360         2.86
   23658.495     0.700000          388         3.33
   24575.999     0.750000          415         4.00
   25116.671     0.775000          429         4.44
   25559.039     0.800000          443         5.00
   26066.943     0.825000          459         5.71
   26427.391     0.850000          472         6.67
   26836.991     0.875000          484         8.00
   27115.519     0.887500          491         8.89
   27410.431     0.900000          498        10.00
   27541.503     0.912500          505        11.43
   27934.719     0.925000          513        13.33
   28131.327     0.937500          519        16.00
   28164.095     0.943750          522        17.78
   28360.703     0.950000          526        20.00
   28524.543     0.956250          529        22.86
   28737.535     0.962500          533        26.67
   28852.223     0.968750          536        32.00
   28917.759     0.971875          538        35.56
   28950.527     0.975000          540        40.00
   28966.911     0.978125          541        45.71
   28999.679     0.981250          543        53.33
   29097.983     0.984375          545        64.00
   29163.519     0.985938          546        71.11
   29179.903     0.987500          547        80.00
   29179.903     0.989062          547        91.43
   29196.287     0.990625          548       106.67
   29212.671     0.992188          550       128.00
   29212.671     0.992969          550       142.22
   29212.671     0.993750          550       160.00
   29212.671     0.994531          550       182.86
   29245.439     0.995313          551       213.33
   29245.439     0.996094          551       256.00
   29294.591     0.996484          552       284.44
   29294.591     0.996875          552       320.00
   29294.591     0.997266          552       365.71
   29294.591     0.997656          552       426.67
   29294.591     0.998047          552       512.00
   29409.279     0.998242          553       568.89
   29409.279     1.000000          553          inf
#[Mean    =    19789.435, StdDeviation   =     5494.707]
#[Max     =    29392.896, Total count    =          553]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  775 requests in 30.02s, 0.99GB read
  Socket errors: connect 0, read 0, write 0, timeout 677
Requests/sec:     25.82
Transfer/sec:     33.62MB
Testing /campaigns?byCreator
Running 30s test @ http://localhost:3014/campaigns?all&byCreator=0xB7d3F81E857692d13e9D63b232A90F4A1793189E
  1 threads and 100 connections
  Thread calibration: mean lat.: 5510.213ms, rate sampling interval: 15908ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    16.21s     4.37s   24.04s    57.77%
    Req/Sec   442.00      0.00   442.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   16.22s
 75.000%   20.02s
 90.000%   22.23s
 99.000%   23.63s
 99.900%   23.89s
 99.990%   24.02s
 99.999%   24.05s
100.000%   24.05s

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    8290.303     0.000000            1         1.00
   10158.079     0.100000          867         1.11
   11665.407     0.200000         1732         1.25
   13189.119     0.300000         2599         1.43
   14688.255     0.400000         3458         1.67
   16220.159     0.500000         4323         2.00
   16973.823     0.550000         4760         2.22
   17727.487     0.600000         5188         2.50
   18497.535     0.650000         5621         2.86
   19251.199     0.700000         6057         3.33
   20021.247     0.750000         6492         4.00
   20398.079     0.775000         6703         4.44
   20758.527     0.800000         6920         5.00
   21135.359     0.825000         7140         5.71
   21495.807     0.850000         7359         6.67
   21856.255     0.875000         7567         8.00
   22036.479     0.887500         7674         8.89
   22233.087     0.900000         7782        10.00
   22429.695     0.912500         7892        11.43
   22609.919     0.925000         7998        13.33
   22790.143     0.937500         8106        16.00
   22888.447     0.943750         8162        17.78
   23003.135     0.950000         8219        20.00
   23101.439     0.956250         8275        22.86
   23183.359     0.962500         8321        26.67
   23281.663     0.968750         8377        32.00
   23347.199     0.971875         8413        35.56
   23379.967     0.975000         8433        40.00
   23445.503     0.978125         8466        45.71
   23478.271     0.981250         8483        53.33
   23527.423     0.984375         8517        64.00
   23560.191     0.985938         8531        71.11
   23576.575     0.987500         8539        80.00
   23609.343     0.989062         8555        91.43
   23642.111     0.990625         8568       106.67
   23674.879     0.992188         8578       128.00
   23691.263     0.992969         8587       142.22
   23707.647     0.993750         8595       160.00
   23724.031     0.994531         8599       182.86
   23756.799     0.995313         8608       213.33
   23789.567     0.996094         8618       256.00
   23789.567     0.996484         8618       284.44
   23789.567     0.996875         8618       320.00
   23805.951     0.997266         8624       365.71
   23822.335     0.997656         8626       426.67
   23838.719     0.998047         8629       512.00
   23855.103     0.998242         8632       568.89
   23855.103     0.998437         8632       640.00
   23871.487     0.998633         8635       731.43
   23871.487     0.998828         8635       853.33
   23887.871     0.999023         8637      1024.00
   23904.255     0.999121         8638      1137.78
   23920.639     0.999219         8639      1280.00
   23937.023     0.999316         8641      1462.86
   23937.023     0.999414         8641      1706.67
   23937.023     0.999512         8641      2048.00
   23953.407     0.999561         8642      2275.56
   23953.407     0.999609         8642      2560.00
   23969.791     0.999658         8643      2925.71
   23969.791     0.999707         8643      3413.33
   23969.791     0.999756         8643      4096.00
   24018.943     0.999780         8644      4551.11
   24018.943     0.999805         8644      5120.00
   24018.943     0.999829         8644      5851.43
   24018.943     0.999854         8644      6826.67
   24018.943     0.999878         8644      8192.00
   24051.711     0.999890         8645      9102.22
   24051.711     1.000000         8645          inf
#[Mean    =    16206.346, StdDeviation   =     4367.846]
#[Max     =    24035.328, Total count    =         8645]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  12051 requests in 30.00s, 1.10GB read
  Socket errors: connect 0, read 0, write 0, timeout 20
Requests/sec:    401.69
Transfer/sec:     37.43MB
Testing /campaigns?byEarner
Running 30s test @ http://localhost:3014/campaigns?byEarner=0xB7d3F81E857692d13e9D63b232A90F4A1793189E
  1 threads and 100 connections
  Thread calibration: mean lat.: 2200.843ms, rate sampling interval: 7606ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.08s     2.22s   12.08s    57.80%
    Req/Sec     1.21k     1.00     1.21k   100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    8.09s
 75.000%   10.00s
 90.000%   11.17s
 99.000%   11.85s
 99.900%   12.01s
 99.990%   12.06s
 99.999%   12.08s
100.000%   12.08s

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    4102.143     0.000000            1         1.00
    5029.887     0.100000         2357         1.11
    5767.167     0.200000         4712         1.25
    6545.407     0.300000         7060         1.43
    7307.263     0.400000         9413         1.67
    8093.695     0.500000        11776         2.00
    8478.719     0.550000        12955         2.22
    8847.359     0.600000        14141         2.50
    9240.575     0.650000        15308         2.86
    9625.599     0.700000        16472         3.33
   10002.431     0.750000        17657         4.00
   10199.039     0.775000        18248         4.44
   10395.647     0.800000        18834         5.00
   10584.063     0.825000        19420         5.71
   10780.671     0.850000        20022         6.67
   10969.087     0.875000        20599         8.00
   11067.391     0.887500        20896         8.89
   11165.695     0.900000        21192        10.00
   11263.999     0.912500        21477        11.43
   11362.303     0.925000        21786        13.33
   11468.799     0.937500        22077        16.00
   11509.759     0.943750        22211        17.78
   11558.911     0.950000        22359        20.00
   11608.063     0.956250        22503        22.86
   11657.215     0.962500        22658        26.67
   11698.175     0.968750        22800        32.00
   11722.751     0.971875        22887        35.56
   11739.135     0.975000        22944        40.00
   11763.711     0.978125        23018        45.71
   11788.287     0.981250        23091        53.33
   11812.863     0.984375        23166        64.00
   11829.247     0.985938        23216        71.11
   11837.439     0.987500        23243        80.00
   11853.823     0.989062        23297        91.43
   11862.015     0.990625        23322       106.67
   11878.399     0.992188        23358       128.00
   11886.591     0.992969        23378       142.22
   11894.783     0.993750        23397       160.00
   11902.975     0.994531        23412       182.86
   11919.359     0.995313        23432       213.33
   11927.551     0.996094        23443       256.00
   11935.743     0.996484        23453       284.44
   11943.935     0.996875        23457       320.00
   11960.319     0.997266        23470       365.71
   11968.511     0.997656        23477       426.67
   11976.703     0.998047        23488       512.00
   11984.895     0.998242        23495       568.89
   11984.895     0.998437        23495       640.00
   11993.087     0.998633        23499       731.43
   12001.279     0.998828        23504       853.33
   12017.663     0.999023        23511      1024.00
   12017.663     0.999121        23511      1137.78
   12025.855     0.999219        23514      1280.00
   12025.855     0.999316        23514      1462.86
   12034.047     0.999414        23519      1706.67
   12034.047     0.999512        23519      2048.00
   12042.239     0.999561        23524      2275.56
   12042.239     0.999609        23524      2560.00
   12042.239     0.999658        23524      2925.71
   12042.239     0.999707        23524      3413.33
   12050.431     0.999756        23526      4096.00
   12050.431     0.999780        23526      4551.11
   12050.431     0.999805        23526      5120.00
   12050.431     0.999829        23526      5851.43
   12058.623     0.999854        23528      6826.67
   12058.623     0.999878        23528      8192.00
   12058.623     0.999890        23528      9102.22
   12058.623     0.999902        23528     10240.00
   12058.623     0.999915        23528     11702.86
   12066.815     0.999927        23529     13653.33
   12066.815     0.999939        23529     16384.00
   12066.815     0.999945        23529     18204.44
   12066.815     0.999951        23529     20480.00
   12066.815     0.999957        23529     23405.71
   12083.199     0.999963        23530     27306.67
   12083.199     1.000000        23530          inf
#[Mean    =     8083.435, StdDeviation   =     2220.022]
#[Max     =    12075.008, Total count    =        23530]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  35707 requests in 30.00s, 0.90GB read
Requests/sec:   1190.22
Transfer/sec:     30.68MB
Testing getting active/ready campaigns with byEarner, limitForPublisher - reached limit
Running 30s test @ http://localhost:3014/campaigns?status=Active,Ready&byEarner=0xB7d3F81E857692d13e9D63b232A90F4A1793189E&limitForPublisher=0xB7d3F81E857692d13e9D63b232A90F4A1793189E
  1 threads and 100 connections
  Thread calibration: mean lat.: 3340.744ms, rate sampling interval: 12025ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    13.08s     3.66s   19.68s    57.86%
    Req/Sec   695.00      0.00   695.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   13.12s
 75.000%   16.24s
 90.000%   18.12s
 99.000%   19.28s
 99.900%   19.55s
 99.990%   19.69s
 99.999%   19.69s
100.000%   19.69s

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    6524.927     0.000000            1         1.00
    7958.527     0.100000         1362         1.11
    9297.919     0.200000         2728         1.25
   10575.871     0.300000         4089         1.43
   11853.823     0.400000         5449         1.67
   13123.583     0.500000         6807         2.00
   13754.367     0.550000         7494         2.22
   14368.767     0.600000         8181         2.50
   14991.359     0.650000         8852         2.86
   15613.951     0.700000         9530         3.33
   16244.735     0.750000        10213         4.00
   16564.223     0.775000        10559         4.44
   16891.903     0.800000        10904         5.00
   17186.815     0.825000        11234         5.71
   17498.111     0.850000        11576         6.67
   17809.407     0.875000        11919         8.00
   17973.247     0.887500        12091         8.89
   18120.703     0.900000        12262        10.00
   18268.159     0.912500        12425        11.43
   18431.999     0.925000        12597        13.33
   18595.839     0.937500        12778        16.00
   18661.375     0.943750        12848        17.78
   18743.295     0.950000        12934        20.00
   18825.215     0.956250        13024        22.86
   18923.519     0.962500        13128        26.67
   18989.055     0.968750        13203        32.00
   19038.207     0.971875        13245        35.56
   19070.975     0.975000        13284        40.00
   19103.743     0.978125        13319        45.71
   19152.895     0.981250        13362        53.33
   19202.047     0.984375        13411        64.00
   19218.431     0.985938        13435        71.11
   19234.815     0.987500        13445        80.00
   19267.583     0.989062        13469        91.43
   19300.351     0.990625        13494       106.67
   19316.735     0.992188        13508       128.00
   19333.119     0.992969        13518       142.22
   19349.503     0.993750        13530       160.00
   19382.271     0.994531        13541       182.86
   19415.039     0.995313        13555       213.33
   19431.423     0.996094        13566       256.00
   19431.423     0.996484        13566       284.44
   19464.191     0.996875        13576       320.00
   19464.191     0.997266        13576       365.71
   19480.575     0.997656        13584       426.67
   19513.343     0.998047        13591       512.00
   19513.343     0.998242        13591       568.89
   19529.727     0.998437        13596       640.00
   19529.727     0.998633        13596       731.43
   19546.111     0.998828        13599       853.33
   19562.495     0.999023        13603      1024.00
   19562.495     0.999121        13603      1137.78
   19562.495     0.999219        13603      1280.00
   19578.879     0.999316        13604      1462.86
   19595.263     0.999414        13607      1706.67
   19595.263     0.999512        13607      2048.00
   19611.647     0.999561        13608      2275.56
   19611.647     0.999609        13608      2560.00
   19628.031     0.999658        13609      2925.71
   19644.415     0.999707        13610      3413.33
   19644.415     0.999756        13610      4096.00
   19660.799     0.999780        13611      4551.11
   19660.799     0.999805        13611      5120.00
   19660.799     0.999829        13611      5851.43
   19693.567     0.999854        13613      6826.67
   19693.567     1.000000        13613          inf
#[Mean    =    13080.518, StdDeviation   =     3656.070]
#[Max     =    19677.184, Total count    =        13613]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  20790 requests in 30.00s, 535.88MB read
Requests/sec:    692.96
Transfer/sec:     17.86MB
Testing getting active/ready campaigns with byEarner, limitForPublisher - unreached limit
Running 30s test @ http://localhost:3014/campaigns?status=Active,Ready&byEarner=0x65B74360431964f587bDcc5fE18C187DC37De286&limitForPublisher=0x65B74360431964f587bDcc5fE18C187DC37De286
  1 threads and 100 connections
  Thread calibration: mean lat.: 3757.653ms, rate sampling interval: 13443ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    14.54s     4.07s   21.95s    57.64%
    Req/Sec   553.00      0.00   553.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   14.57s
 75.000%   18.09s
 90.000%   20.17s
 99.000%   21.43s
 99.900%   21.68s
 99.990%   21.94s
 99.999%   21.97s
100.000%   21.97s

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    7282.687     0.000000            1         1.00
    8888.319     0.100000         1081         1.11
   10330.111     0.200000         2167         1.25
   11730.943     0.300000         3248         1.43
   13139.967     0.400000         4325         1.67
   14573.567     0.500000         5408         2.00
   15278.079     0.550000         5944         2.22
   15982.591     0.600000         6486         2.50
   16687.103     0.650000         7029         2.86
   17367.039     0.700000         7566         3.33
   18087.935     0.750000         8108         4.00
   18448.383     0.775000         8378         4.44
   18792.447     0.800000         8651         5.00
   19120.127     0.825000         8923         5.71
   19464.191     0.850000         9189         6.67
   19808.255     0.875000         9464         8.00
   19988.479     0.887500         9600         8.89
   20168.703     0.900000         9735        10.00
   20348.927     0.912500         9875        11.43
   20512.767     0.925000        10001        13.33
   20692.991     0.937500        10139        16.00
   20758.527     0.943750        10200        17.78
   20856.831     0.950000        10277        20.00
   20938.751     0.956250        10341        22.86
   21020.671     0.962500        10406        26.67
   21102.591     0.968750        10475        32.00
   21151.743     0.971875        10504        35.56
   21200.895     0.975000        10546        40.00
   21233.663     0.978125        10571        45.71
   21299.199     0.981250        10611        53.33
   21348.351     0.984375        10646        64.00
   21364.735     0.985938        10663        71.11
   21381.119     0.987500        10676        80.00
   21413.887     0.989062        10693        91.43
   21446.655     0.990625        10706       106.67
   21479.423     0.992188        10726       128.00
   21495.807     0.992969        10737       142.22
   21512.191     0.993750        10746       160.00
   21512.191     0.994531        10746       182.86
   21528.575     0.995313        10756       213.33
   21561.343     0.996094        10769       256.00
   21561.343     0.996484        10769       284.44
   21577.727     0.996875        10774       320.00
   21594.111     0.997266        10779       365.71
   21610.495     0.997656        10782       426.67
   21626.879     0.998047        10785       512.00
   21643.263     0.998242        10788       568.89
   21659.647     0.998437        10792       640.00
   21659.647     0.998633        10792       731.43
   21676.031     0.998828        10794       853.33
   21708.799     0.999023        10795      1024.00
   21725.183     0.999121        10796      1137.78
   21741.567     0.999219        10797      1280.00
   21757.951     0.999316        10800      1462.86
   21757.951     0.999414        10800      1706.67
   21757.951     0.999512        10800      2048.00
   21790.719     0.999561        10802      2275.56
   21790.719     0.999609        10802      2560.00
   21790.719     0.999658        10802      2925.71
   21790.719     0.999707        10802      3413.33
   21807.103     0.999756        10803      4096.00
   21807.103     0.999780        10803      4551.11
   21807.103     0.999805        10803      5120.00
   21938.175     0.999829        10804      5851.43
   21938.175     0.999854        10804      6826.67
   21938.175     0.999878        10804      8192.00
   21938.175     0.999890        10804      9102.22
   21938.175     0.999902        10804     10240.00
   21970.943     0.999915        10805     11702.86
   21970.943     1.000000        10805          inf
#[Mean    =    14543.825, StdDeviation   =     4065.994]
#[Max     =    21954.560, Total count    =        10805]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  16447 requests in 30.00s, 649.00MB read
Requests/sec:    548.23
Transfer/sec:     21.63MB
Testing limiting 10 campaigns
Running 30s test @ http://localhost:3014/campaigns?all&limit=10
  1 threads and 100 connections
  Thread calibration: mean lat.: 1793.329ms, rate sampling interval: 6344ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.71s     1.84s    9.86s    57.12%
    Req/Sec     1.35k    11.67     1.37k    66.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    6.70s
 75.000%    8.34s
 90.000%    9.26s
 99.000%    9.76s
 99.900%    9.84s
 99.990%    9.85s
 99.999%    9.87s
100.000%    9.87s

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    3512.319     0.000000            1         1.00
    4147.199     0.100000         2644         1.11
    4734.975     0.200000         5278         1.25
    5447.679     0.300000         7920         1.43
    6086.655     0.400000        10556         1.67
    6696.959     0.500000        13184         2.00
    7077.887     0.550000        14503         2.22
    7421.951     0.600000        15832         2.50
    7700.479     0.650000        17143         2.86
    7995.391     0.700000        18460         3.33
    8343.551     0.750000        19789         4.00
    8486.911     0.775000        20461         4.44
    8626.175     0.800000        21107         5.00
    8773.631     0.825000        21770         5.71
    8945.663     0.850000        22407         6.67
    9109.503     0.875000        23067         8.00
    9191.423     0.887500        23405         8.89
    9256.959     0.900000        23729        10.00
    9330.687     0.912500        24061        11.43
    9404.415     0.925000        24399        13.33
    9469.951     0.937500        24726        16.00
    9502.719     0.943750        24915        17.78
    9543.679     0.950000        25045        20.00
    9576.447     0.956250        25217        22.86
    9609.215     0.962500        25401        26.67
    9633.791     0.968750        25542        32.00
    9658.367     0.971875        25628        35.56
    9682.943     0.975000        25710        40.00
    9707.519     0.978125        25815        45.71
    9723.903     0.981250        25904        53.33
    9740.287     0.984375        25990        64.00
    9740.287     0.985938        25990        71.11
    9748.479     0.987500        26043        80.00
    9756.671     0.989062        26090        91.43
    9764.863     0.990625        26133       106.67
    9773.055     0.992188        26164       128.00
    9781.247     0.992969        26195       142.22
    9781.247     0.993750        26195       160.00
    9789.439     0.994531        26223       182.86
    9797.631     0.995313        26243       213.33
    9805.823     0.996094        26265       256.00
    9814.015     0.996484        26288       284.44
    9814.015     0.996875        26288       320.00
    9814.015     0.997266        26288       365.71
    9822.207     0.997656        26312       426.67
    9822.207     0.998047        26312       512.00
    9822.207     0.998242        26312       568.89
    9830.399     0.998437        26331       640.00
    9830.399     0.998633        26331       731.43
    9830.399     0.998828        26331       853.33
    9838.591     0.999023        26343      1024.00
    9838.591     0.999121        26343      1137.78
    9838.591     0.999219        26343      1280.00
    9838.591     0.999316        26343      1462.86
    9838.591     0.999414        26343      1706.67
    9846.783     0.999512        26348      2048.00
    9846.783     0.999561        26348      2275.56
    9846.783     0.999609        26348      2560.00
    9854.975     0.999658        26355      2925.71
    9854.975     0.999707        26355      3413.33
    9854.975     0.999756        26355      4096.00
    9854.975     0.999780        26355      4551.11
    9854.975     0.999805        26355      5120.00
    9854.975     0.999829        26355      5851.43
    9854.975     0.999854        26355      6826.67
    9854.975     0.999878        26355      8192.00
    9863.167     0.999890        26357      9102.22
    9863.167     0.999902        26357     10240.00
    9863.167     0.999915        26357     11702.86
    9863.167     0.999927        26357     13653.33
    9863.167     0.999939        26357     16384.00
    9863.167     0.999945        26357     18204.44
    9863.167     0.999951        26357     20480.00
    9863.167     0.999957        26357     23405.71
    9871.359     0.999963        26358     27306.67
    9871.359     1.000000        26358          inf
#[Mean    =     6711.983, StdDeviation   =     1842.422]
#[Max     =     9863.168, Total count    =        26358]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  39893 requests in 30.00s, 1.05GB read
Requests/sec:   1329.76
Transfer/sec:     35.91MB
Get unhealthy campaigns - 1 total in test data
Running 30s test @ http://localhost:3014/campaigns?status=Waiting
  1 threads and 100 connections
  Thread calibration: mean lat.: 3.736ms, rate sampling interval: 11ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.93ms    2.42ms  40.38ms   86.36%
    Req/Sec     2.10k   461.69     4.80k    75.84%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.43ms
 75.000%    4.55ms
 90.000%    6.06ms
 99.000%   13.35ms
 99.900%   25.82ms
 99.990%   36.70ms
 99.999%   40.42ms
100.000%   40.42ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.519     0.000000            1         1.00
       1.897     0.100000         3905         1.11
       2.387     0.200000         7812         1.25
       2.749     0.300000        11717         1.43
       3.085     0.400000        15601         1.67
       3.429     0.500000        19505         2.00
       3.611     0.550000        21461         2.22
       3.811     0.600000        23402         2.50
       4.027     0.650000        25355         2.86
       4.271     0.700000        27314         3.33
       4.551     0.750000        29251         4.00
       4.715     0.775000        30246         4.44
       4.903     0.800000        31208         5.00
       5.095     0.825000        32196         5.71
       5.343     0.850000        33160         6.67
       5.639     0.875000        34138         8.00
       5.831     0.887500        34618         8.89
       6.063     0.900000        35104        10.00
       6.367     0.912500        35589        11.43
       6.835     0.925000        36078        13.33
       7.539     0.937500        36564        16.00
       7.903     0.943750        36807        17.78
       8.279     0.950000        37056        20.00
       8.679     0.956250        37296        22.86
       9.119     0.962500        37542        26.67
       9.567     0.968750        37785        32.00
       9.823     0.971875        37905        35.56
      10.151     0.975000        38026        40.00
      10.543     0.978125        38147        45.71
      11.071     0.981250        38270        53.33
      11.799     0.984375        38393        64.00
      12.159     0.985938        38452        71.11
      12.631     0.987500        38513        80.00
      13.071     0.989062        38574        91.43
      13.679     0.990625        38635       106.67
      14.279     0.992188        38697       128.00
      14.527     0.992969        38726       142.22
      14.967     0.993750        38757       160.00
      15.607     0.994531        38788       182.86
      16.255     0.995313        38818       213.33
      17.391     0.996094        38849       256.00
      18.031     0.996484        38863       284.44
      19.439     0.996875        38879       320.00
      20.015     0.997266        38894       365.71
      20.991     0.997656        38910       426.67
      21.711     0.998047        38924       512.00
      22.351     0.998242        38932       568.89
      23.279     0.998437        38940       640.00
      24.159     0.998633        38947       731.43
      25.071     0.998828        38955       853.33
      25.855     0.999023        38962      1024.00
      26.687     0.999121        38966      1137.78
      26.783     0.999219        38970      1280.00
      27.311     0.999316        38975      1462.86
      27.439     0.999414        38978      1706.67
      28.511     0.999512        38981      2048.00
      28.783     0.999561        38983      2275.56
      29.759     0.999609        38985      2560.00
      31.551     0.999658        38987      2925.71
      32.463     0.999707        38989      3413.33
      33.087     0.999756        38991      4096.00
      34.079     0.999780        38992      4551.11
      34.303     0.999805        38993      5120.00
      34.399     0.999829        38994      5851.43
      34.975     0.999854        38995      6826.67
      36.703     0.999878        38996      8192.00
      36.703     0.999890        38996      9102.22
      37.151     0.999902        38997     10240.00
      37.151     0.999915        38997     11702.86
      37.343     0.999927        38998     13653.33
      37.343     0.999939        38998     16384.00
      37.343     0.999945        38998     18204.44
      37.407     0.999951        38999     20480.00
      37.407     0.999957        38999     23405.71
      37.407     0.999963        38999     27306.67
      37.407     0.999969        38999     32768.00
      37.407     0.999973        38999     36408.89
      40.415     0.999976        39000     40960.00
      40.415     1.000000        39000          inf
#[Mean    =        3.925, StdDeviation   =        2.424]
#[Max     =       40.384, Total count    =        39000]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  59551 requests in 30.00s, 133.29MB read
Requests/sec:   1984.91
Transfer/sec:      4.44MB